# data-database-types-relational-language-SQL-MySQL-CRU_D_-delete-command-DELETE-foreign-key-ON-DELETE-SET-NULL
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **enforce** - **behaviour** - **ON** **DELETE** **SET** **NULL** - **deleting** **row** - record - tuple - that is a **referenced** - **foreign** **key** [1]

- **flow** **over** from the **table** - entity - relation - **row** - record - tuple - **deleted** - **to** the **table** - entity - relation - **referencing** the **foreign** **key** - **associated** **row** - record - tuple - - **set** to **NULL** [1]

```sql
mysql> use bus;
Database changed
```

```sql
mysql> show tables;
+---------------+
| Tables_in_bus |
+---------------+
| bus           |
| driver        |
+---------------+
2 rows in set (0.01 sec)
```

```sql
mysql> SELECT *
    -> FROM bus;
+------------+---------------+----------+
| reg        | maxPassengers | fuel     |
+------------+---------------+----------+
| 12-G-1323  |            34 | Petrol   |
| 161-D-1323 |            80 | Diesel   |
| 162-D-3433 |           120 | Electric |
| 191-G-123  |            56 | Diesel   |
+------------+---------------+----------+
4 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM driver;
+-----------+------+------------+
| licenceNo | name | busReg     |
+-----------+------+------------+
| F2233     | Alan | 191-G-123  |
| L23423    | John | 12-G-1323  |
| X98983    | Tom  | 161-D-1323 |
+-----------+------+------------+
3 rows in set (0.00 sec)
```

```sql
mysql> SHOW CREATE TABLE bus;
+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Table | Create Table                                                                                                                                                                                                      |
+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| bus   | CREATE TABLE `bus` (
  `reg` varchar(15) NOT NULL,
  `maxPassengers` int DEFAULT NULL,
  `fuel` enum('Diesel','Petrol','Electric') DEFAULT 'Diesel',
  PRIMARY KEY (`reg`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1 |
+-------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
1 row in set (0.00 sec)
```

```sql
mysql> SHOW CREATE TABLE driver;
+--------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Table  | Create Table                                                                                                                                                                                                                                                                                                                      |
+--------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| driver | CREATE TABLE `driver` (
  `licenceNo` varchar(20) NOT NULL,
  `name` varchar(30) DEFAULT NULL,
  `busReg` varchar(15) DEFAULT NULL,
  PRIMARY KEY (`licenceNo`),
  KEY `busReg` (`busReg`),
  CONSTRAINT `driver_ibfk_1` FOREIGN KEY (`busReg`) REFERENCES `bus` (`reg`) ON DELETE SET NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 |
+--------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
1 row in set (0.00 sec)
```

- deleting row - record - tuple - from table - entity - relation - bus  [1]

```sql
+------------+---------------+----------+
| reg        | maxPassengers | fuel     |
+------------+---------------+----------+
| 191-G-123  |            56 | Diesel   |
+------------+---------------+----------
```

- row - record - tuple - in the table - entity - relation - driver - is referencing this row - record - tuple - in the table - entity - relation - bus [1]

```sql
+-----------+------+------------+
| licenceNo | name | busReg     |
+-----------+------+------------+
| F2233     | Alan | 191-G-123  |
+-----------+------+------------+
```

- **behaviour** - **ON** **DELETE** **SET** **NULL** - **enforced** - **row** - record - tuple - **referenced** by **table** - entity - relation - driver - **set** to **NULL** - now the reference in the table - entity - relation - bus - is no longer referenced - deleted [1]

```sql
CONSTRAINT `driver_ibfk_1` FOREIGN KEY (`busReg`) REFERENCES `bus` (`reg`) ON DELETE SET NULL
```

```sql
+-----------+------+------------+
| licenceNo | name | busReg     |
+-----------+------+------------+
| F2233     | Alan | NULL       |
+-----------+------+------------+
```

```sql
mysql> SELECT *
    -> FROM driver;
+-----------+------+------------+
| licenceNo | name | busReg     |
+-----------+------+------------+
| F2233     | Alan | NULL       |
| L23423    | John | 12-G-1323  |
| X98983    | Tom  | 161-D-1323 |
+-----------+------+------------+
3 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM bus;
+------------+---------------+----------+
| reg        | maxPassengers | fuel     |
+------------+---------------+----------+
| 12-G-1323  |            34 | Petrol   |
| 161-D-1323 |            80 | Diesel   |
| 162-D-3433 |           120 | Electric |
+------------+---------------+----------+
3 rows in set (0.00 sec)
```

- similar to - ON DELETE CASCADE - **mysql** - does **not** **indicate** that the **row** - record - tuple - from **referenced** **table** - entity - relation - driver - **set** to **NULL** - indicates just that a row - record - tuple - was deleted from the - table - entity - relation - bus [1]

***
# END